# Pandas

In [9]:
import pandas as pd

### Creating Dataframe

In [10]:
data = {
    'Name': ['Tamanna', 'Faysal', 'Tarek', 'Raisa', 'Imtiaz', 'Farah'],
    'Age': [24, 27, 22, 32, 24, 22],
    'City': ['Dhaka', 'Sylthet', 'Dhaka', 'Khulna', 'Rajshahi', 'Sylhet'],
    'Score': [85, 95, 78, 90, 88, 84]
}
df = pd.DataFrame(data)
df

      Name  Age      City  Score
0  Tamanna   24     Dhaka     85
1   Faysal   27   Sylthet     95
2    Tarek   22     Dhaka     78
3    Raisa   32    Khulna     90
4   Imtiaz   24  Rajshahi     88
5    Farah   22    Sylhet     84

### Working with Columns

In [ ]:
# Display the first few rows of the 'Name' column
# df["Column_name"]
# .head() => print only the first 5
df['Name'].tail(3)

3     Raisa
4    Imtiaz
5     Farah
Name: Name, dtype: object

In [19]:
df.City

0       Dhaka
1     Sylthet
2       Dhaka
3      Khulna
4    Rajshahi
5      Sylhet
Name: City, dtype: object

In [20]:
df.City[3]

'Khulna'

In [17]:
df["Age"][3]

np.int64(32)

In [22]:
df[["Name", "City"]].head()

      Name      City
0  Tamanna     Dhaka
1   Faysal   Sylthet
2    Tarek     Dhaka
3    Raisa    Khulna
4   Imtiaz  Rajshahi